# SetUnits Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..SetUnits Method
Document Class See Also
---
Sets the units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetUnits(
	Units units
)
```

Visual Basic
---
```text
Public Sub SetUnits ( _
	units As Units _
)
```

Visual C++
---
```text
public:
void SetUnits(
	Units^ units
)
```

# ### Parameters
units
    Type: Autodesk.Revit.DB..::..Units The units.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Document Class
Autodesk.Revit.DB Namespace